; domain
(define (domain liftedtcore_minigrid-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :equality :conditional-effects :existential-preconditions :universal-preconditions :action-costs)
 (:types
    room objectordoor color - object
    object_ door - objectordoor
    empty_0 ball box - object_
 )
 (:constants
   empty - empty_0
   blue_door_2 - door
   room_3 room_2 - room
   blue_box_1 - box
 )
 (:predicates (agentinroom ?room - room) (objectinroom ?obj - object_ ?room - room) (objectcolor ?objectordoor - objectordoor ?color - color) (at_ ?objectordoor - objectordoor) (carrying ?obj - object_) (locked ?door - door) (adjacentrooms ?room1 - room ?room2 - room ?door - door) (blocked ?door - door ?obj - object_ ?room - room) (visited ?room - room) (emptyhands) (hold_0) (hold_1) (hold_2))
 (:functions (total-cost))
 (:action gotoobject
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (objectinroom ?obj ?room) (agentinroom ?room))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?obj) (increase (total-cost) 1)))
 (:action gotoempty
  :parameters ()
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ empty) (increase (total-cost) 1)))
 (:action gotodoor
  :parameters ( ?door - door ?room1 - room ?room2 - room)
  :precondition (and (adjacentrooms ?room1 ?room2 ?door) (agentinroom ?room1) (forall (?o - object_)
 (not (blocked ?door ?o ?room1))))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?door) (increase (total-cost) 1)))
 (:action gotoroom
  :parameters ( ?room1 - room ?room2 - room ?door - door)
  :precondition (and (agentinroom ?room1) (adjacentrooms ?room1 ?room2 ?door) (not (locked ?door)))
  :effect (and (not (agentinroom ?room1)) (agentinroom ?room2) (visited ?room2)(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (when (and (locked blue_door_2) (not (or (not (emptyhands)) (= ?room2 room_2) (and (agentinroom room_2) (not (= ?room1 room_2)))))) (not (hold_1))) (when (or (not (emptyhands)) (= ?room2 room_2) (and (agentinroom room_2) (not (= ?room1 room_2)))) (hold_1)) (when (or (= ?room2 room_3) (and (agentinroom room_3) (not (= ?room1 room_3))) (objectinroom blue_box_1 room_3)) (hold_2)) (increase (total-cost) 1)))
 (:action pick
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (objectinroom ?obj ?room) (at_ ?obj) (emptyhands))
  :effect (and (not (at_ ?obj)) (not (emptyhands)) (carrying ?obj) (not (objectinroom ?obj ?room))(forall (?d - door) (when (blocked ?d ?obj ?room) (not (blocked ?d ?obj ?room)))) (hold_1) (when (or (agentinroom room_3) (and (objectinroom blue_box_1 room_3) (not (and (= ?obj blue_box_1) (= ?room room_3))))) (hold_2)) (increase (total-cost) 1)))
 (:action drop
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (carrying ?obj) (not (emptyhands)) (at_ empty))
  :effect (and (not (carrying ?obj)) (at_ ?obj) (not (at_ empty)) (emptyhands) (objectinroom ?obj ?room) (when (and (locked blue_door_2) (not (agentinroom room_2))) (not (hold_1))) (when (agentinroom room_2) (hold_1)) (when (or (agentinroom room_3) (and (= ?obj blue_box_1) (= ?room room_3)) (objectinroom blue_box_1 room_3)) (hold_2)) (increase (total-cost) 1)))
 (:action toggle
  :parameters ( ?door - door)
  :precondition (and (at_ ?door))
  :effect (and (when (not (locked ?door)) (locked ?door)) (when (locked ?door) (not (locked ?door))) (when (or (and (not (locked ?door)) (= ?door blue_door_2)) (and (locked blue_door_2) (not (and (locked ?door) (= ?door blue_door_2))))) (hold_0)) (when (and (or (and (not (locked ?door)) (= ?door blue_door_2)) (and (locked blue_door_2) (not (and (locked ?door) (= ?door blue_door_2))))) (not (or (not (emptyhands)) (agentinroom room_2)))) (not (hold_1))) (increase (total-cost) 1)))
)

; problem
(define (problem liftedtcore_minigrid-problem)
 (:domain liftedtcore_minigrid-domain)
 (:objects
   room_1 room_4 - room
   redtype greentype bluetype yellowtype purpletype greytype - color
   green_door_1 blue_door_1 red_door_1 - door
   yellow_ball_1 purple_ball_1 red_ball_1 blue_ball_1 - ball
   grey_box_1 blue_box_2 grey_box_2 - box
 )
 (:init (agentinroom room_4) (objectinroom grey_box_1 room_1) (objectinroom purple_ball_1 room_1) (objectinroom blue_ball_1 room_1) (objectinroom grey_box_2 room_1) (objectinroom yellow_ball_1 room_2) (objectinroom blue_box_1 room_2) (objectinroom red_ball_1 room_2) (objectinroom blue_box_2 room_3) (objectcolor grey_box_1 greytype) (objectcolor purple_ball_1 purpletype) (objectcolor blue_ball_1 bluetype) (objectcolor grey_box_2 greytype) (objectcolor yellow_ball_1 yellowtype) (objectcolor blue_box_1 bluetype) (objectcolor red_ball_1 redtype) (objectcolor blue_box_2 bluetype) (objectcolor green_door_1 greentype) (objectcolor blue_door_1 bluetype) (objectcolor blue_door_2 bluetype) (objectcolor red_door_1 redtype) (emptyhands) (locked green_door_1) (locked blue_door_1) (locked blue_door_2) (locked red_door_1) (adjacentrooms room_2 room_1 green_door_1) (adjacentrooms room_1 room_2 green_door_1) (adjacentrooms room_3 room_1 blue_door_1) (adjacentrooms room_1 room_3 blue_door_1) (adjacentrooms room_4 room_2 blue_door_2) (adjacentrooms room_2 room_4 blue_door_2) (adjacentrooms room_4 room_3 red_door_1) (adjacentrooms room_3 room_4 red_door_1) (visited room_4) (hold_0) (= (total-cost) 0))
 (:goal (and (exists (?d - door)
 (and (objectcolor ?d bluetype) (at_ ?d) (not (locked ?d)))) (hold_0) (hold_1) (hold_2)))
 (:metric minimize (total-cost))
)

; plan
1. (gotodoor red_door_1 room_4 room_3)
   added: (at_ red_door_1)
   goals met: 1 of 4
2. (toggle red_door_1)
   deleted: (locked red_door_1)
   goals met: 1 of 4
3. (gotoroom room_4 room_3 red_door_1)
   deleted: (agentinroom room_4) (at_ red_door_1)
   added: (agentinroom room_3) (visited room_3) (hold_2)
   goals met: 2 of 4
4. (gotoobject blue_box_2 room_3)
   added: (at_ blue_box_2)
   goals met: 2 of 4
5. (pick blue_box_2 room_3)
   deleted: (at_ blue_box_2) (emptyhands) (objectinroom blue_box_2 room_3)
   added: (carrying blue_box_2) (hold_1)
   goals met: 3 of 4
6. (gotodoor blue_door_1 room_3 room_1)
   added: (at_ blue_door_1)
   goals met: 3 of 4
7. (toggle blue_door_1)
   deleted: (locked blue_door_1)
   goals met: 4 of 4
